<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class TambonsSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $tambonArray = [
// [3508, 350801, '*น้ำคำ', '35120'],
            // [3508, 350802, 'บุ่งค้า', '35120'],
            // [3508, 350803, 'สวาท', '35120'],
            // [3508, 350804, '*ส้มผ่อ', '35120'],
            [3508, 350805, 'ห้องแซง', '35120'],
            [3508, 350806, 'สามัคคี', '35120'],
            [3508, 350807, 'กุดเชียงหมี', '35120'],
            // [3508, 350808, '*คำเตย', '35120'],
            // [3508, 350809, '*คำไผ่', '35120'],
            // [3508, 350810, 'สามแยก', '35120'],
            // [3508, 350811, 'กุดแห่', '35120'],
            // [3508, 350812, 'โคกสำราญ', '35120'],
            // [3508, 350813, 'สร้างมิ่ง', '35120'],
            // [3508, 350814, 'ศรีแก้ว', '35120'],
            // [3508, 350815, '*ไทยเจริญ', '35120'],
            // [3508, 350895, '*ไทยเจริญ', '35120'],
            // [3508, 350896, '*คำไผ่', '35120'],
            // [3508, 350897, '*คำเตย', '35120'],
            // [3508, 350898, '*ส้มผ่อ', '35120'],
            // [3508, 350899, '*น้ำคำ', '35120'],
                [3405,'340501', 'เขมราฐ',34170],
                [3405,'340502', 'กองโพน',34170],
                [3405,'340503', 'ขามป้อม',34170],
                [3405,'340504', 'เจียด',34170],
                [3405,'340505', 'พังเคน',34170],
                [3405,'340506', 'นาตาล',34170],
                [3405,'340507', 'หนองผือ',34170],
                [3405, '340508', 'นาแวง',34170],
                [3405, '340509', '*พะลาน',34170],
                [3405, '340510', 'แก้งเหนือ',34170],
                [3405, '340511', 'หนองนกทา',34170],
                [3405, '340512', 'หนองสิม',34170],
                [3405, '340513', 'หัวนา',34170],
                [4701, '470101', 'ธาตุเชิงชุม', 47000],
                [4701, '470102', 'ขมิ้น', 47000],
                [4701, '470103', 'งิ้วด่อน', 47000],
                [4701, '470104', 'โนนหอม', 47000],
                [4701, '470105', 'นาตงวัฒนา', 47000],
                [4701, '470106', 'เชียงเครือ', 47000],
                [4701, '470107', 'ท่าแร่', 47000],
                [4701, '470108', 'บ้านโพน', 47000],
                [4701, '470109', 'ม่วงลาย', 47000],
                [4701, '470110', 'กกปลาซิว', 47000],
                [4701, '470111', 'ดงชน', 47000],
                [4701, '470112', 'ห้วยยาง', 47000],
                [4701, '470113', 'พังขว้าง', 47000],
                [4701, '470114', 'นาแก้ว', 47000],
                [4701, '470115', 'ดงมะไฟ', 47000],
                [4701, '470116', 'ธาตุนาเวง', 47000],
                [4701, '470117', 'เหล่าปอแดง', 47000],
                [4701, '470118', 'หนองลาด', 47000],
                [4701, '470119', 'บ้านแป้น', 47000],
                [4701, '470120', 'ฮางโฮง', 47000],
                [4701, '470121', 'โคกก่อง', 47000],
                [4714, '471401', 'เต่างอย', 47260],
                [4714, '471402', 'บึงทวาย',47260],
                [4714, '471403', 'นาตาล',47260],
                [4714, '471404', 'จันทร์เพ็ญ',47260],

        ];
        foreach ($tambonArray as $tambon){
            DB::table('tambons')->insert([
                'id' => $tambon[1],
                'tambon_name' => $tambon[2],
                'district_id' => $tambon[0],
                'zipcode' => $tambon[3],
                'created_at' => date('Y-m-d H:i:s'),
                'updated_at' => date('Y-m-d H:i:s')
            ]);
        }
    }
}
